app/views/pockets/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.select(:user_id) do %>
    <%= options_from_collection_for_select(User.all, :id, :name) %>