app/views/pockets/show.html.erb

SELECT "incomes".* FROM "incomes" WHERE "incomes"."pocket_id" = ?  [["pocket_id", 1]]
---
  <ul>
    <% @pocket.incomes.each do |income| %>

SELECT "outgoings".* FROM "outgoings" WHERE "outgoings"."pocket_id" = ?  [["pocket_id", 1]]
---
  <ul>
    <% @pocket.outgoings.each do |outgoing| %>

SELECT "calendars".* FROM "calendars" WHERE "calendars"."pocket_id" = ?  [["pocket_id", 1]]
---
  <ul>
    <% @pocket.calendars.each do |calendar| %>