app/views/users/show.html.erb

SELECT "pockets".* FROM "pockets" WHERE "pockets"."user_id" = ?  [["user_id", 1]]
---
  <ul>
    <% @user.pockets.each do |pocket| %>

SELECT "categories".* FROM "categories" WHERE "categories"."user_id" = ?  [["user_id", 1]]
---
  <ul>
    <% @user.categories.each do |category| %>

SELECT "incomes".* FROM "incomes" WHERE "incomes"."user_id" = ?  [["user_id", 1]]
---
  <ul>
    <% @user.incomes.each do |income| %>

SELECT "outgoings".* FROM "outgoings" WHERE "outgoings"."user_id" = ?  [["user_id", 1]]
---
  <ul>
    <% @user.outgoings.each do |outgoing| %>

SELECT "calendars".* FROM "calendars" WHERE "calendars"."user_id" = ?  [["user_id", 1]]
---
  <ul>
    <% @user.calendars.each do |calendar| %>