app/views/incomes/_form.html.erb

SELECT "users".* FROM "users"
---
    <%= f.select(:user_id) do %>
    <%= options_from_collection_for_select(User.all, :id, :name) %>

SELECT "pockets".* FROM "pockets"
---
    <%= f.select(:pocket_id) do %>
    <%= options_from_collection_for_select(Pocket.all, :id, :name) %>

SELECT "categories".* FROM "categories" WHERE "categories"."way" = ?  [["way", 0]]
---
    <%= f.select(:category_id) do %>
    <%= options_from_collection_for_select(Category.order(:way).all, :id, :name) %>