app/views/calendars/_form.html.erb

    <%= f.select(:user_id) do %>
    <%= options_from_collection_for_select(User.all, :id, :name) %>
---
SELECT "users".* FROM "users"

    <%= f.select(:pocket_id) do %>
    <%= options_from_collection_for_select(Pocket.all, :id, :name) %>
---
SELECT "pockets".* FROM "pockets"