app/controllers/calendars_controller.rb

  def index
    @calendars = Calendar.all
---
SELECT "calendars".* FROM "calendars"

  def create
    @calendar = Calendar.new(calendar_params)

    respond_to do |format|
      if @calendar.save
---
INSERT INTO "calendars" ("sum_income", "sum_outgoing", "balance", "pocket_id", "user_id", "period", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_calendar
      @calendar = Calendar.find(params[:id])
---
SELECT  "calendars".* FROM "calendars" WHERE "calendars"."id" = ? LIMIT 1  [["id", 1]]