app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "way", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Grocery"], ["way", "t"], ["user_id", 1], ["created_at", "2015-11-18 10:35:36.091552"], ["updated_at", "2015-11-18 10:35:36.091552"]]