app/controllers/incomes_controller.rb

SELECT "incomes".* FROM "incomes"
---
  def index
    @incomes = Income.all

INSERT INTO "incomes" ("note", "sum", "category_id", "pocket_id", "user_id", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @income = Income.new(income_params)

    respond_to do |format|
      if @income.save

UPDATE "incomes" SET "note" = ?, "sum" = ?, "updated_at" = ? WHERE "incomes"."id" = ?  [["note", "pocket money for november"], ["sum", 250.0], ["updated_at", "2015-11-18 10:37:14.358074"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @income.update(income_params)

SELECT  "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_income
      @income = Income.find(params[:id])