app/controllers/outgoings_controller.rb

SELECT "outgoings".* FROM "outgoings"
---
  def index
    @outgoings = Outgoing.all

INSERT INTO "outgoings" ("note", "sum", "category_id", "pocket_id", "user_id", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @outgoing = Outgoing.new(outgoing_params)

    respond_to do |format|
      if @outgoing.save

SELECT  "outgoings".* FROM "outgoings" WHERE "outgoings"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_outgoing
      @outgoing = Outgoing.find(params[:id])