app/controllers/pockets_controller.rb

  def index
    @pockets = Pocket.all
---
SELECT "pockets".* FROM "pockets"

  def create
    @pocket = Pocket.new(pocket_params)

    respond_to do |format|
      if @pocket.save
---
INSERT INTO "pockets" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Bar"], ["user_id", 1], ["created_at", "2015-11-18 10:35:09.762721"], ["updated_at", "2015-11-18 10:35:09.762721"]]

    def set_pocket
      @pocket = Pocket.find(params[:id])
---
SELECT  "pockets".* FROM "pockets" WHERE "pockets"."id" = ? LIMIT 1  [["id", 1]]