app/views/categories/show.html.erb

SELECT "incomes".* FROM "incomes" WHERE "incomes"."category_id" = ?  [["category_id", 2]]
---
	  <ul>
	    <% @category.incomes.each do |income| %>

SELECT "outgoings".* FROM "outgoings" WHERE "outgoings"."category_id" = ?  [["category_id", 1]]
---
	  <ul>
	    <% @category.outgoings.each do |outgoing| %>